app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 ORDER BY "posts"."created_at" DESC LIMIT $2  [["id", 241], ["LIMIT", 1]]
---
    def show
        @post = Post.find(params[:id])

SELECT "categories".* FROM "categories" WHERE "categories"."branch" = $1  [["branch", "hobby"]]
---
    def new
      @branch = params[:branch]
      @categories = Category.where(branch: @branch)