app/controllers/private/conversations_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 ORDER BY "posts"."created_at" DESC LIMIT $2  [["id", 245], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1  [["id", 4]]
INSERT INTO "private_conversations" ("recipient_id", "sender_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["recipient_id", 4], ["sender_id", 11], ["created_at", "2024-02-15 15:41:22.164477"], ["updated_at", "2024-02-15 15:41:22.164477"]]
INSERT INTO "private_messages" ("body", "user_id", "conversation_id", "seen", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["body", "rodolfos"], ["user_id", 4], ["conversation_id", 1], ["seen", false], ["created_at", "2024-02-15 15:41:22.196688"], ["updated_at", "2024-02-15 15:41:22.196688"]]
---
    def create
      recipient_id = Post.find(params[:post_id]).user.id
      @conversation = Private::Conversation.new(sender_id: current_user.id,
                                                recipient_id: recipient_id)
      if @conversation.save
        Private::Message.create(user_id: recipient_id,
                                conversation_id: @conversation.id,
                                body: params[:message_body])